<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    
    <meta name="description" content="I try to exploit multiple vulnerabilities in a student's project as if it was a CTF">
    <meta property="og:description" content="I try to exploit multiple vulnerabilities in a student's project as if it was a CTF" />
    

    <meta property="og:title" content="(An Attempt at) Pwning a Chip8 Emulator" />
    
    <meta property="og:type" content="article" />
    
    <meta property="og:url" content="/blog/attempt-at-pwning-a-chip8-emulator" />
    <meta property="og:image" content="http://localhost:4000/images/pic.jpg">
    <meta property="og:site_name" content="Luca's Blog">
    <meta name="twitter:card" content="summary_large_image">

    <meta name="twitter:site" content="@lucabtz_">


    <title>(An Attempt at) Pwning a Chip8 Emulator - Luca's Blog</title>

    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link
        href="https://fonts.googleapis.com/css2?family=IBM+Plex+Mono:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;1,100;1,200;1,300;1,400;1,500;1,600;1,700&display=swap"
        rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="/assets/styles/main.css">
    <link rel="canonical" href="http://localhost:4000/blog/attempt-at-pwning-a-chip8-emulator">
</head>

<body>

points to. For example calling <code class="language-plaintext highlighter-rouge">printf@plt</code> I can achieve the following</p>
<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>└─$ ./Chip8 exploit
hello world
this is written by the chip8's code
zsh: segmentation fault  ./Chip8 exploit

</code></pre></div></div>

<h3 id="arbitrary-file-read-using-load_rom">Arbitrary file read using <code class="language-plaintext highlighter-rouge">load_ROM</code></h3>

<p>There is one interesting function to call and it is <code class="language-plaintext highlighter-rouge">load_ROM</code>! This just read any file into the Chip8’s memory starting at
address <code class="language-plaintext highlighter-rouge">0x200</code>. I thought I can just read <code class="language-plaintext highlighter-rouge">/proc/self/maps</code> and kill ASLR. Unfortunately, I’d like to find the <code class="language-plaintext highlighter-rouge">libc</code> base
(to then call <code class="language-plaintext highlighter-rouge">system</code>) and the file is so big that the <code class="language-plaintext highlighter-rouge">libc</code> address wouldn’t end up in the readable memory. In general it 
turns out I can’t really read files under <code class="language-plaintext highlighter-rouge">/proc</code> as the <code class="language-plaintext highlighter-rouge">size</code> local variable in <code class="language-plaintext highlighter-rouge">load_ROM</code> ends up being zero when reading them.</p>

<p>Overall this is an interesting primitive, but not being able to read <code class="language-plaintext highlighter-rouge">/proc</code> files leaves me confused on how to use this to defeat
ASLR (which is what keeping me from calling <code class="language-plaintext highlighter-rouge">system</code> and getting arbitrary code execution).</p>

<h2 id="conclusion">Conclusion</h2>

<p>Unfortunately I was not able to turn this into arbitrary code execution: my limited knowledge and the fact that the imported 
functions by the binary are so few make the exploitation not straightforward. However I would argue there are loads of 
possibilities to be explored with the primitives I built.</p>

<p>Also this was all done disabling PIE, with PIE enabled the explotation seems more complicated. It would be possible to use a
partial overwrite to overwrite the <code class="language-plaintext highlighter-rouge">sound</code> pointer, however this lives on the heap and we have no control of the heap, so even
then the partial overwrite would be useless.</p>

<p>Anyhow, here is the full hello world exploit code. Please if you are able to turn this into arbitrary code execution let me know
by sending a DM on <a href="https://x.com/lucabtz_">X</a>, thanks for reading!</p>
<div class="language-py highlighter-rouge"><div class="highlight"><pre class="highlight"><code><span class="kn">import</span> <span class="nn">pwn</span>

<span class="c1"># pwndbg&gt; ptype /o struct Chip8
#/* offset      |    size */  type = struct Chip8 {
#/*      0      |    4096 */    uint8_t memory[4096];
#/*   4096      |    2048 */    uint8_t display[2048];
#/*   6144      |       2 */    uint16_t pc;
#/*   6146      |       2 */    uint16_t index;
#/*   6148      |      32 */    uint16_t stack[16];
#/*   6180      |       1 */    uint8_t stack_pointer;
#/*   6181      |       1 */    uint8_t delay;
#/*   6182      |       1 */    uint8_t sound;
#/*   6183      |      16 */    uint8_t registers[16];
#/* XXX  1-byte hole      */
#/*   6200      |       2 */    uint16_t op_code;
#/*   6202      |       1 */    uint8_t draw_flag;
#/*   6203      |       1 */    uint8_t draw_wait;
#/*   6204      |      16 */    uint8_t input[16];
#
#                               /* total size (bytes): 6220 */
#                             }
</span>

<span class="n">ROM_START_OFFSET</span>   <span class="o">=</span> <span class="mh">0x200</span>

<span class="c1"># chip struct offsets from rom start
</span><span class="n">PC_OFFSET</span>          <span class="o">=</span> <span class="mi">6144</span> <span class="o">-</span> <span class="mh">0x200</span>
<span class="n">SP_OFFSET</span>          <span class="o">=</span> <span class="mi">6180</span> <span class="o">-</span> <span class="mh">0x200</span>
<span class="n">CHIP_STRUCT_SIZE</span>   <span class="o">=</span> <span class="mi">6220</span>

<span class="n">MUSIC_ADDR</span>         <span class="o">=</span> <span class="mh">0x406990</span>
<span class="n">CHIP_ADDR</span>          <span class="o">=</span> <span class="mh">0x405120</span>
